In [1]:
import numpy as np
import pandas as pd 
from datetime import date
import datetime as dt

In [2]:
dfc1 = pd.read_excel("customer_data.xlsx",sheet_name = "Data 1")
dfc2 = pd.read_excel("customer_data.xlsx",sheet_name = "Data 2")
dfe = pd.read_csv("edu_data.csv")
dfp = pd.read_csv("project_data.csv")

In [3]:
dfc1.head()

,cust_id,year_of_birth,educational_status_code,marital_status,annual_income,full_name
0,20201733,1940,GD,Married,40548.0,Abhinav Bal
1,20202059,1943,NaN,Married,65073.0,Nimai Neela
2,20202195,1944,PH,Divorced,55614.0,Somatra Savant
3,20201983,1946,GD,Relationship,46276.0,Kamana Nath
4,20202060,1948,PH,Divorced,46681.0,Ninarika Chandrasekar

In [4]:
dfc1.shape

(111, 6)

In [5]:
dfc2.shape

(280, 6)

In [6]:
dfe.shape

(5, 2)

In [7]:
dfp.shape

(499, 8)

In [8]:
dfp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499 entries, 0 to 498
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       499 non-null    int64
 1   purhcase_date     499 non-null    object
 2   recency           499 non-null    int64
 3   online_purchases  499 non-null    int64
 4   store_purchases   499 non-null    int64
 5   complaints        499 non-null    int64
 6   calls             499 non-null    int64
 7   intercoms         499 non-null    int64
dtypes: int64(7), object(1)
memory usage: 31.3+ KB

In [9]:
dfc1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111 entries, 0 to 110
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   cust_id                  111 non-null    int64
 1   year_of_birth            111 non-null    int64
 2   educational_status_code  103 non-null    object
 3   marital_status           111 non-null    object
 4   annual_income            105 non-null    float64
 5   full_name                111 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 5.3+ KB

In [10]:
dfp.describe()

,customer_id,recency,online_purchases,store_purchases,complaints,calls,intercoms
count,4.990000e+02,499.000000,499.000000,499.000000,499.000000,499.000000,499.000000
mean,2.020195e+07,48.228457,3.969940,5.779559,0.252505,3.370741,10.168337
std,1.441932e+02,29.077101,2.813675,3.301378,1.115953,4.327091,2.800552
min,2.020170e+07,0.000000,0.000000,0.000000,0.000000,0.000000,2.000000
25%,2.020183e+07,23.000000,2.000000,3.000000,0.000000,3.000000,11.000000
50%,2.020195e+07,47.000000,3.000000,5.000000,0.000000,3.000000,11.000000
75%,2.020207e+07,74.000000,6.000000,8.000000,0.000000,3.000000,11.000000
max,2.020220e+07,99.000000,27.000000,13.000000,11.000000,88.000000,44.000000

In [11]:
dfc1.isnull().sum()

cust_id                    0
year_of_birth              0
educational_status_code    8
marital_status             0
annual_income              6
full_name                  0
dtype: int64